Ran Plan for dir: `vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_firewall.atlantis_test_firewall must be replaced
-/+ resource "google_compute_firewall" "atlantis_test_firewall" {
      ~ creation_timestamp      = "2023-11-13T06:06:45.700-08:00" -> (known after apply)
      ~ destination_ranges      = [] -> (known after apply)
      ~ direction               = "INGRESS" -> (known after apply)
      - disabled                = false -> null
      + enable_logging          = (known after apply)
      ~ id                      = "projects/premium-guide-403909/global/firewalls/atlantis-test" -> (known after apply)
      ~ name                    = "atlantis-test" -> "atlantis-demo-firewall" # forces replacement
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/firewalls/atlantis-test" -> (known after apply)
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.118.115.250/lock?id=devabolmasov%252Fatlantis%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`